{
  "Meaning and Impact": [
    "Describe the most meaningful moment you experienced today.",
    "Who benefited most from something positive you did today, and how?",
    "How did today's experiences contribute to the person you are becoming?",
    "If you wrote a memoir, what single sentence would capture today?",
    "If you had to repeat today with the same constraints, what would you do differently?"
  ],
  "Energy and Emotions": [
    "When did you feel your highest and lowest energy today, and what caused those shifts?",
    "What emotion did you feel most often today, and what does that tell you?",
    "What activities or moments restored your energy?",
    "Which experiences drained your energy the most?",
    "What sources of stress were present today?",
    "Did you ignore any signals from your body that you wish you hadn’t?"
  ],
  "Attention and Focus": [
    "When did you feel most focused and why?",
    "What task felt most immersive today, and what made it so engaging?",
    "What repeated distractions did you face, and how could you reduce them?",
    "How well did your time spent today match your intentions?",
    "What is one thing you could remove from your day to improve your focus?"
  ],
  "Learning and Growth": [
    "What did you learn today that was new or surprising?",
    "Where did your curiosity lead you—or where did it get shut down?",
    "Did you try something new or run a small experiment, and what did it reveal?",
    "What mistake turned out to be most useful, and how could you use that lesson?",
    "What question from today deserves deeper exploration?"
  ],
  "Relationships and Communication": [
    "Who made you feel truly listened to today?",
    "Where did you feel only partially heard?",
    "What conversation gave you a sense of life and energy, and why?",
    "Where did you show kindness today—and where did you hold it back?",
    "What assumptions did you make about others that went untested?",
    "Is there anyone you need to follow up with, apologize to, or thank?"
  ],
  "Purpose and Priorities": [
    "Did your actions today reflect your values, or did you drift from them?",
    "Which priority did you make progress on, and which did you neglect?",
    "Did you say ‘yes’ to something that should have been a ‘no’?",
    "Was there an important item you postponed that matters in the long run?",
    "What was the single most important task you completed today?"
  ],
  "Creativity and Problem Solving": [
    "Where did you show originality or come up with a fresh idea?",
    "Was there a constraint or limit that helped you find a better solution?",
    "What problem did you avoid today but now feel ready to face?",
    "What idea came to you worth capturing for future use?",
    "What small creative act could you try tomorrow?"
  ],
  "Health and Habits": [
    "How did your sleep, movement, nourishment, or support systems affect today?",
    "Which habit was most helpful for your well-being?",
    "Which habit got in the way or held you back?",
    "Did you take breaks before or after feeling depleted?",
    "What did your nervous system need today?",
    "What one habit tweak could have a bigger positive impact over time?"
  ],
  "Decision Making": [
    "Did you make any quick decisions today that deserved more consideration?",
    "Is there a delayed decision that you’re ready to make?",
    "Were there any default choices you made automatically without questioning?",
    "What criteria guided your choices today?",
    "If a friend faced your hardest choice from today, what advice would you give them?"
  ],
  "Gratitude and Appreciation": [
    "What was surprisingly good or easier than expected today?",
    "Who made your life easier, and have you thanked them?",
    "What small beauty or detail did you notice today?",
    "What’s one thing you’d miss most if it were gone for a year?",
    "What deserves celebration from today?"
  ],
  "Forward Look": [
    "What remains unfinished that needs your attention tomorrow?",
    "What is one action you could take to make tomorrow better?",
    "What boundary could you set or reinforce for a healthier day?",
    "What reminder should you place for tomorrow?",
    "What would be tomorrow’s ideal headline, and what can you do to make it true?"
  ]
}
